[
        {
            "id": 1,
            "name": "Kevin Andego",
            "role": "Managing Partner",
            "imageUrl":
              "/andego/kevin_andego.jpg",
              "description": "Kevin, Managing Partner at the firm, is a University of Nairobi graduate with a Post Graduate Diploma from Kenya School of Law. Passionate about law, he leverages it for societal betterment. Specializing in Corporate law, he manages incorporation, insolvency, mergers, acquisitions, and commercial transactions. Additionally, he handles Conveyancing transactions in Real Estate projects, covering transfers, leases, securities registration, and joint ventures. With expertise in Civil and Criminal litigation, Family, Constitutional, and Public Interest Law, Kevin is a versatile advocate committed to legal excellence across diverse domains."
          },
      
          {
            "id":2,
            "name": "Patrick Kimani",
            "role": "Partner",
            "imageUrl":
              "/andego/patrick_kimani.jpg",
              "description": "Patrick Kimani is a partner at the Firm. He is an LLB-graduate from Strathmore Law School and has a Post Graduate Diploma from the Kenya School of Law. His legal acumen is broadened by a diploma in International Commercial Arbitration and Investment Arbitration from the Austrian Arbitration Academy, and a certificate in Public Policy Analysis from the London School of Economics and Public Policy.Professionally, Patrick advises clients across various sectors, including banking, microfinance, security services, retail, energy, real estate, manufacturing, and assembly. He has a notable track record in cross-border mergers and acquisitions (M&A) transactions throughout the region. Beyond his commercial law practice, Patrick has contributed to the legal field through his involvement in international criminal justice, including participation in efforts related to the prosecution of high-profile international criminals during his time at the UN Residual Mechanism for Criminal Tribunals in Tanzania. His professional journey reflects a commitment to excellence, ethical practice, and a significant contribution to both local and international legal landscapes."
          },
          
          {
            "id":3,
            "name": "Michael Tendwa",
            "role": "Senior Associate",
            "imageUrl":
              "/andego/michael_tendwa.jpg",
              "description":"Michael Tendwa, an Associate specializing in civil and commercial litigation, employment, and family law, boasts extensive experience in corporate matters and dispute resolution. His expertise spans contract review, trademark registration, and regulatory compliance across various industries like FMCG, software, and energy. Previously at MW & Company Advocates LLP, he excelled in litigation, contract review, and intellectual property registration, achieving favorable results for clients through adept legal research and drafting. As an Advocate of the High Court of Kenya with an LLB from Strathmore University, Tendwa brings a robust background to his legal practice, ensuring effective representation and successful outcomes."
          },
      
          {
            "id":4,
            "name": "Paul Tirop",
            "role": "Associate",
            "imageUrl":
              "/andego/paul_tirop.jpg",
              "description":"Paul is an associate with the Firm. He holds a bachelor of laws degree from the University of Nairobi (LLB) and a post graduate Diploma from the Kenya School of Law. He has extensive litigation experience in tax, personal injury and insurance, family, conveyancing and commercial law matters to name but a few. His research and practice interests are in civil and commercial litigation, data protection, intellectual property and information technology law.Paul holds a certificate in Theology from the New Creation Bible College."
          },
      
         
      
          {
            "id":5,
            "name": "Gloria Mwanzia",
            "role": "Office Administrator",
            "imageUrl":
              "/andego/gloria_mwanzia.jpg",
              "description":"Gloria Mwanzia excels in her primary role as an Office Administrator, where she is instrumental in overseeing operations across the office with unparalleled efficiency and attention to detail. With a robust background in criminology and security studies, including a Bachelor's degree, a Diploma, and Certificates in Criminology and Security, as well as specialized training in Closed Circuit Television from the Kenya Institute of Security and Criminal Justice, Gloria brings a unique perspective to her administrative duties.In her capacity as Office Administrator, Gloria ensures the smooth functioning of office operations, adeptly managing supplies, distributing and collecting materials, and maintaining up-to-date test logs. Her meticulous approach to administration and organization ensures that all aspects of the office run seamlessly, allowing for enhanced productivity and operational excellence. Gloria's dual expertise underscores her significant contribution to the organization, where she continues to leverage her diverse skill set to the benefit of her team and the wider community."
          },
      
          {
            "id":6,
            "name": "Leah Wanjohi",
            "role": "Intern",
            "imageUrl":
              "/andego/leah_wanjohi.jpg",
              "description":"Leah Wanjohi, an intern at the Firm, is in the process of refining her legal expertise. With an LLB from the University of Nairobi, she is now pursuing the Advocate Training Programme at the Kenya School of Law, where she focuses on legal drafting, research, and writing. Leah's practical experience includes a previous internship at Anjarwalla & Khanna Advocates - ALN in the Litigation Department, where she assisted in commercial and corporate litigation research, drafting legal documents, and contributed to various legal projects. Leah's role at the Firm is characterized by her continuous learning and contribution to legal tasks, showcasing her growing proficiency and potential in the legal field."
          },
      
          {
            "id":7,
            "name": "Jackline Ndichu",
            "role": "Intern",
            "imageUrl":
              "/andego/jackline_ndichu.jpg",
              "description":"Jackline Ndichu is an intern at the Firm, where she actively applies her burgeoning legal knowledge while continuing her LLB studies at the University of Nairobi. As a law student, Jackline is in a unique position of continuously learning on the job, allowing her to directly integrate theoretical insights with practical experience. Her areas of special interest include energy and natural resources, mergers and acquisitions (M&A), corporate restructurings, private equity, and arbitration. This breadth of interests highlights her eagerness to explore diverse facets of law and her commitment to developing a comprehensive understanding of these critical areas. Jackline's ongoing education and hands-on experience at the Firm position her as a dynamic contributor to the team, with a keen eye on the evolving landscape of legal practice."
          }
    ]
